celery.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-26 Wed 17:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>celery</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="mark" />
<link rel="stylesheet" href="http://markwh1te.github.io/org.css" type="text/css" >
</head>
<body>
<div id="content">
<h1 class="title">celery</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. Don't pass model objects to tasks</a>
<ul>
<li><a href="#orgheadline1">1.1. Since tasks don't run immediately, by the time a task runs and looks at a model object that was passed to it, the corresponding record in the database might have changed. If the task then does something to the model object and saves it, those changes in the database are overwritten by older data.</a></li>
</ul>
</li>
<li><a href="#orgheadline3">2. celery 清空队列中所有未完成的任务</a></li>
<li><a href="#orgheadline4">3. celery 设置worker 的数量</a></li>
<li><a href="#orgheadline5">4. django celery 不执行　send due task</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> Don't pass model objects to tasks</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Since tasks don't run immediately, by the time a task runs and looks at a model object that was passed to it, the corresponding record in the database might have changed. If the task then does something to the model object and saves it, those changes in the database are overwritten by older data.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It's almost always safer to save the object, pass the record's key, and look up the object again in the task
</p>
<div class="org-src-container">

<pre class="src src-python">myobject.save<span style="color: #268bd2;">()</span>
mytask.delay<span style="color: #268bd2;">(</span>myobject.pk<span style="color: #268bd2;">)</span>
<span style="color: #af005f; font-weight: bold;">@task</span>
<span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">mytask</span><span style="color: #268bd2;">(</span>pk<span style="color: #268bd2;">)</span>:
    <span style="color: #af5fd7;">myobject</span> = MyModel.objects.get<span style="color: #268bd2;">(</span>pk=pk<span style="color: #268bd2;">)</span>
    ...
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> celery 清空队列中所有未完成的任务</h2>
<div class="outline-text-2" id="text-2">
<p>
celery -A proj purge
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> celery 设置worker 的数量</h2>
<div class="outline-text-2" id="text-3">
<p>
-c + worker<sub>number</sub>
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">4</span> django celery 不执行　send due task</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://stackoverflow.com/questions/19997989/periodic-task-for-celery-sent-but-not-executed">SO Link</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mark</p>
<p class="date">Created: 2016-10-26 Wed 17:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
